amazons3-connector-test/src/resources/artifacts/ESB/config/soapRequests/amazons3/getObject.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.amazons3.getObject">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:accessKeyId>AKIAIGURZM7GJ7TRO6KQ</urn:accessKeyId>
      <urn:secretAccessKey>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</urn:secretAccessKey>
      <urn:methodType>GET</urn:methodType>
      <urn:contentType>text/plain</urn:contentType>
      <urn:bucketName>imagesBucket5</urn:bucketName>
      <urn:xAmzDate>true</urn:xAmzDate>
      <urn:xAmzSecurityToken/>
      <urn:contentMD5/>
      <urn:bucketUrl>http://s3.amazonaws.com/imagesBucket5</urn:bucketUrl>
      <urn:uriRemainder>/testObject18</urn:uriRemainder>
      <urn:host>s3.amazonaws.com</urn:host>
      <urn:rangeBytes/>
      <urn:responseContentType/>
      <urn:responseContentLanguage/>
      <urn:responseExpires/>
      <urn:responseCacheControl/>
      <urn:responseContentDisposition/>
      <urn:range/>
      <urn:ifModifiedSince/>
      <urn:ifUnmodifiedSince/>
      <urn:ifMatch/>
      <urn:ifNoneMatch/>
   </soapenv:Body>
</soapenv:Envelope>